---
kind: method
id: M:Autodesk.Revit.DB.SolidCurveIntersection.Dispose
source: html/18c1a54a-0f8c-ccd3-2d66-db2cd0caa2cc.htm
---
# Autodesk.Revit.DB.SolidCurveIntersection.Dispose Method

Releases all resources used by the SolidCurveIntersection

## Syntax (C#)
```csharp
public void Dispose()
```